In [1]:
import pandas as pd

In [2]:
employees = pd.read_csv("employees.csv")

In [3]:
employees.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    object
 2   Start Date         1000 non-null   object
 3   Last Login Time    1000 non-null   object
 4   Salary             1000 non-null   int64
 5   Bonus %            1000 non-null   float64
 6   Senior Management  933 non-null    object
 7   Team               957 non-null    object
dtypes: float64(1), int64(1), object(6)
memory usage: 62.6+ KB

In [4]:
employees["Start Date"] = pd.to_datetime(employees["Start Date"], format = "%m/%d/%Y")

In [5]:
employees["Last Login Time"] = pd.to_datetime(employees["Last Login Time"], format = "%H:%M %p").dt.time

In [6]:
employees["Senior Management"] = employees["Senior Management"].astype(bool)

In [7]:
employees["Gender"] = employees["Gender"].astype("category")

In [8]:
employees.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    category
 2   Start Date         1000 non-null   datetime64[ns]
 3   Last Login Time    1000 non-null   object
 4   Salary             1000 non-null   int64
 5   Bonus %            1000 non-null   float64
 6   Senior Management  1000 non-null   bool
 7   Team               957 non-null    object
dtypes: bool(1), category(1), datetime64[ns](1), float64(1), int64(1), object(3)
memory usage: 49.1+ KB

In [9]:
employees = pd.read_csv("employees.csv", parse_dates = ["Start Date"], date_format = "%m/%d/%Y")

In [10]:
employees[employees["Gender"] == "Male"]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,6:53 AM,61933,4.170,True,NaN
3,Jerry,Male,2005-03-04,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,4:47 PM,101004,1.389,True,Client Services
5,Dennis,Male,1987-04-18,1:35 AM,115163,10.125,False,Legal
...,...,...,...,...,...,...,...,...
994,George,Male,2013-06-21,5:47 PM,98874,4.479,True,Marketing
996,Phillip,Male,1984-01-31,6:30 AM,42392,19.675,False,Finance
997,Russell,Male,2013-05-20,12:39 PM,96914,1.421,False,Product
998,Larry,Male,2013-04-20,4:45 PM,60500,11.985,False,Business Development
999,Albert,Male,2012-05-15,6:24 PM,129949,10.169,True,Sales

In [11]:
employees[employees["Team"] == "Finance"]
on_finance_team = employees["Team"] == "Finance"
employees[on_finance_team]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
2,Maria,Female,1993-04-23,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,1:00 PM,138705,9.340,True,Finance
7,NaN,Female,2015-07-20,10:43 AM,45906,11.598,NaN,Finance
14,Kimberly,Female,1999-01-14,7:13 AM,41426,14.543,True,Finance
46,Bruce,Male,2009-11-28,10:47 PM,114796,6.796,False,Finance
...,...,...,...,...,...,...,...,...
907,Elizabeth,Female,1998-07-27,11:12 AM,137144,10.081,False,Finance
954,Joe,Male,1980-01-19,4:06 PM,119667,1.148,True,Finance
987,Gloria,Female,2014-12-08,5:08 AM,136709,10.331,True,Finance
992,Anthony,Male,2011-10-16,8:35 AM,112769,11.625,True,Finance
996,Phillip,Male,1984-01-31,6:30 AM,42392,19.675,False,Finance

In [12]:
employees[employees["Senior Management"] == True]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,6:53 AM,61933,4.170,True,NaN
3,Jerry,Male,2005-03-04,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,4:47 PM,101004,1.389,True,Client Services
6,Ruby,Female,1987-08-17,4:20 PM,65476,10.012,True,Product
...,...,...,...,...,...,...,...,...
991,Rose,Female,2002-08-25,5:12 AM,134505,11.051,True,Marketing
992,Anthony,Male,2011-10-16,8:35 AM,112769,11.625,True,Finance
993,Tina,Female,1997-05-15,3:53 PM,56450,19.040,True,Engineering
994,George,Male,2013-06-21,5:47 PM,98874,4.479,True,Marketing
999,Albert,Male,2012-05-15,6:24 PM,129949,10.169,True,Sales

In [13]:
import datetime as dt

In [14]:
employees[employees["Salary"] > 110000]
employees[employees["Bonus %"] < 1.5]
employees[employees["Start Date"] < "1985-01-01"]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
10,Louise,Female,1980-08-12,9:01 AM,63241,15.132,True,NaN
12,Brandon,Male,1980-12-01,1:08 AM,112807,17.492,True,Human Resources
18,Diana,Female,1981-10-23,10:27 AM,132940,19.082,False,Client Services
28,Terry,Male,1981-11-27,6:30 PM,124008,13.464,True,Client Services
37,Linda,Female,1981-10-19,8:49 PM,57427,9.557,True,Client Services
...,...,...,...,...,...,...,...,...
982,Rose,Female,1982-04-06,10:43 AM,91411,8.639,True,Human Resources
983,John,Male,1982-12-23,10:35 PM,146907,11.738,False,Engineering
985,Stephen,NaN,1983-07-10,8:10 PM,85668,1.909,False,Legal
986,Donna,Female,1982-11-26,7:04 AM,82871,17.999,False,Marketing
996,Phillip,Male,1984-01-31,6:30 AM,42392,19.675,False,Finance

In [15]:
employees[employees["Last Login Time"] < str(dt.time(12, 0, 0))]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
2,Maria,Female,1993-04-23,11:17 AM,130590,11.858,False,Finance
7,NaN,Female,2015-07-20,10:43 AM,45906,11.598,NaN,Finance
13,Gary,Male,2008-01-27,11:40 PM,109831,5.831,False,Sales
18,Diana,Female,1981-10-23,10:27 AM,132940,19.082,False,Client Services
24,John,Male,1992-07-01,10:08 PM,97950,13.873,False,Client Services
...,...,...,...,...,...,...,...,...
968,Louise,Female,1995-03-27,10:27 PM,43050,11.671,False,Distribution
973,Russell,Male,2013-05-10,11:08 PM,137359,11.105,False,Business Development
975,Susan,Female,1995-04-07,10:05 PM,92436,12.467,False,Sales
982,Rose,Female,1982-04-06,10:43 AM,91411,8.639,True,Human Resources
983,John,Male,1982-12-23,10:35 PM,146907,11.738,False,Engineering

In [24]:
is_female = employees["Gender"] == "Female"
is_in_marketing = employees["Team"] == "Marketing"
salary_over_100k = employees["Salary"] > 100000

In [25]:
is_female & is_in_marketing & salary_over_100k

0      False
1      False
2      False
3      False
4      False
       ...
995    False
996    False
997    False
998    False
999    False
Length: 1000, dtype: bool

In [26]:
employees[is_female & is_in_marketing & salary_over_100k]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
98,Tina,Female,2016-06-16,7:47 PM,100705,16.961,True,Marketing
140,Shirley,Female,1981-02-28,1:23 PM,113850,1.854,False,Marketing
158,Norma,Female,1999-02-28,8:45 PM,114412,8.756,True,Marketing
305,Margaret,Female,1993-02-06,1:05 PM,125220,3.733,False,Marketing
319,Jacqueline,Female,1981-11-25,3:01 PM,145988,18.243,False,Marketing
379,NaN,Female,2002-09-18,12:39 PM,118906,4.537,NaN,Marketing
468,Janice,Female,1997-06-28,1:48 PM,136032,10.696,True,Marketing
490,Judith,Female,2007-11-23,1:22 PM,117055,7.461,False,Marketing
531,Virginia,Female,2010-05-02,9:10 PM,123649,10.154,True,Marketing
585,Shirley,Female,1988-04-16,11:09 AM,132156,2.754,False,Marketing
627,Anne,Female,1984-11-21,12:30 PM,128305,16.636,False,Marketing
656,Lisa,Female,1982-02-09,6:44 PM,113592,17.108,True,Marketing
675,Diane,Female,2009-10-30,6:56 PM,130577,12.791,False,Marketing
676,Annie,Female,1992-06-06,10:04 AM,138925,9.801,True,Marketing
811,Judith,Female,1989-09-03,11:16 AM,134048,6.818,True,Marketing
813,Evelyn,Female,2002-02-10,4:44 AM,123621,19.767,True,Marketing
881,Ruby,Female,1980-01-28,11:08 PM,142868,6.318,False,Marketing
991,Rose,Female,2002-08-25,5:12 AM,134505,11.051,True,Marketing